app/views/lists/index.html.erb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 3
---
<ul data-role="listview" data-filter="true" data-filter-placeholder="Search lists..." data-inset="true" data-icon="delete">
	<% @user.lists.each do |list| %>