app/views/lists/show.html.erb

<ul data-role="listview" data-inset="true" data-icon="delete" data-filter="true" data-filter-placeholder="Search items...">
		<% @list.items.each do |item|%>
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = 34