app/controllers/items_controller.rb

  def index
    @items = @list.items.all
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = 35

  def show
    @item = @list.items.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = 36 AND "items"."id" = ? LIMIT 1  [["id", "13"]]

  def edit
    @item = @list.items.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = 45 AND "items"."id" = ? LIMIT 1  [["id", "31"]]

  def create
    @item = @list.items.new(params[:item])

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("brand", "category", "created_at", "description", "list_id", "name", "note", "quantity", "unit", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @item = @list.items.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = 45 AND "items"."id" = ? LIMIT 1  [["id", "31"]]
UPDATE "items" SET "description" = 'Oscar Meyer', "updated_at" = '2013-06-15 04:13:40.910316' WHERE "items"."id" = 31

  def destroy
    Item.find(params[:id]).destroy
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 16]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "16"]]