app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 3
---
  def index
    @lists = @user.lists.all

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 3 AND "lists"."id" = ? LIMIT 1  [["id", "6"]]
---
  def show
    @list = @user.lists.find(params[:id])

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 3 AND "lists"."id" = ? LIMIT 1  [["id", "9"]]
---
  def edit
    @list = @user.lists.find(params[:id])

INSERT INTO "lists" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 04 Jun 2013 02:18:45 UTC +00:00], ["name", "Steve's New List 1"], ["updated_at", Tue, 04 Jun 2013 02:18:45 UTC +00:00], ["user_id", nil]]
---
  def create
    @list = @user.lists.new(params[:list])

    respond_to do |format|
      if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 3 AND "lists"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "lists" SET "name" = 'List 2', "updated_at" = '2013-06-08 15:51:11.258372' WHERE "lists"."id" = 9
---
  def update
    @list = @user.lists.find(params[:id])

    respond_to do |format|
      if @list.update_attributes(params[:list])

DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy
    List.find(params[:id]).destroy